#pragma once
#include <DirectXMath.h>
#include "KDirectInit.h"

using namespace DirectX;

// 頂点データ構造体
struct Vertex {
	XMFLOAT3 pos;	 // xyz座標
	XMFLOAT3 normal; // 法線ベクトル
	XMFLOAT2 uv;	 // uv座標
};

// 頂点データ
static Vertex vertices[] = {
	//  x	  y	    z		  u	   v
	// 前
	{{-5.0f,-5.0f,-5.0f},{},{0.0f,1.0f}}, // 左下
	{{-5.0f, 5.0f,-5.0f},{},{0.0f,0.0f}}, // 左上
	{{ 5.0f,-5.0f,-5.0f},{},{1.0f,1.0f}}, // 右下
	{{ 5.0f, 5.0f,-5.0f},{},{1.0f,0.0f}}, // 右上
	// 後
	{{ 5.0f,-5.0f, 5.0f},{},{1.0f,1.0f}}, // 右下
	{{ 5.0f, 5.0f, 5.0f},{},{1.0f,0.0f}}, // 右上
	{{-5.0f,-5.0f, 5.0f},{},{0.0f,1.0f}}, // 左下
	{{-5.0f, 5.0f, 5.0f},{},{0.0f,0.0f}}, // 左上
	// 左
	{{-5.0f,-5.0f,-5.0f},{},{0.0f,1.0f}}, // 左下
	{{-5.0f,-5.0f, 5.0f},{},{0.0f,0.0f}}, // 左上
	{{-5.0f, 5.0f,-5.0f},{},{1.0f,1.0f}}, // 右下
	{{-5.0f, 5.0f, 5.0f},{},{1.0f,0.0f}}, // 右上
	// 右
	{{ 5.0f, 5.0f,-5.0f},{},{1.0f,1.0f}}, // 右下
	{{ 5.0f, 5.0f, 5.0f},{},{1.0f,0.0f}}, // 右上
	{{ 5.0f,-5.0f,-5.0f},{},{0.0f,1.0f}}, // 左下
	{{ 5.0f,-5.0f, 5.0f},{},{0.0f,0.0f}}, // 左上
	// 下
	{{ 5.0f,-5.0f,-5.0f},{},{1.0f,1.0f}}, // 右下
	{{ 5.0f,-5.0f, 5.0f},{},{1.0f,0.0f}}, // 右上
	{{-5.0f,-5.0f,-5.0f},{},{0.0f,1.0f}}, // 左下
	{{-5.0f,-5.0f, 5.0f},{},{0.0f,0.0f}}, // 左上
	// 上
	{{-5.0f, 5.0f,-5.0f},{},{0.0f,1.0f}}, // 左下
	{{-5.0f, 5.0f, 5.0f},{},{0.0f,0.0f}}, // 左上
	{{ 5.0f, 5.0f,-5.0f},{},{1.0f,1.0f}}, // 右下
	{{ 5.0f, 5.0f, 5.0f},{},{1.0f,0.0f}}  // 右上
};

class KVertex
{
public:
	KVertex(KDirectInit dx);
	void KVertexInit(KDirectInit dx);

	// 頂点データ全体のサイズ = 頂点データ一つ分のサイズ * 頂点データの要素数
	UINT sizeVB;
	// 頂点バッファの設定
	D3D12_HEAP_PROPERTIES heapProp{};
	// リソース設定
	D3D12_RESOURCE_DESC resDesc{};
	// 頂点バッファの生成
	ID3D12Resource* vertBuff = nullptr;
};

